# Mini Project One

# Missing Values

In [36]:
import pandas as pd
df=pd.read_csv('weather_data.csv')
df

   Condition Play        City  Temperature  Humidity        Date
0      Rainy  Yes    Hyderbad           30        60  03-01-2025
1      Sunny  Yes    Hyderbad           35        40  06-01-2025
2   Overcast  Yes    Hyderbad           25        67  14-01-2025
3   Overcast  Yes    Hyderbad           45        58  24-01-2025
4      Sunny   No    Hyderbad           42        48  25-01-2025
5      Rainy  Yes  Vijayawada           30        86  03-02-2025
6      Sunny  Yes  Vijayawada           47        57  07-02-2025
7   Overcast  Yes  Vijayawada           26        74  12-02-2025
8      Rainy   No  Vijayawada           36        36  15-02-2025
9      Sunny   No  Vijayawada           47        95  22-02-2025
10     Sunny  Yes    Banglore           29        65  27-02-2025
11     Rainy   No    Banglore           37        57  03-03-2025
12  Overcast  Yes    Banglore           39        67  25-03-2025
13  Overcast  Yes    Banglore           28        85  29-03-2025

# Exploring Data

In [2]:
df.head()

  Condition Play      City  Temperature  Humidity        Date
0     Rainy  Yes  Hyderbad           30        60  03-01-2025
1     Sunny  Yes  Hyderbad           35        40  06-01-2025
2  Overcast  Yes  Hyderbad           25        67  14-01-2025
3  Overcast  Yes  Hyderbad           45        58  24-01-2025
4     Sunny   No  Hyderbad           42        48  25-01-2025

In [3]:
df.tail()

   Condition Play        City  Temperature  Humidity        Date
9      Sunny   No  Vijayawada           47        95  22-02-2025
10     Sunny  Yes    Banglore           29        65  27-02-2025
11     Rainy   No    Banglore           37        57  03-03-2025
12  Overcast  Yes    Banglore           39        67  25-03-2025
13  Overcast  Yes    Banglore           28        85  29-03-2025

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Condition    14 non-null     object
 1   Play         14 non-null     object
 2   City         14 non-null     object
 3   Temperature  14 non-null     int64
 4   Humidity     14 non-null     int64
 5   Date         14 non-null     object
dtypes: int64(2), object(4)
memory usage: 804.0+ bytes

In [20]:
df.shape

(14, 6)

In [21]:
df[2:6]

  Condition Play        City  Temperature  Humidity        Date
2  Overcast  Yes    Hyderbad           25        67  14-01-2025
3  Overcast  Yes    Hyderbad           45        58  24-01-2025
4     Sunny   No    Hyderbad           42        48  25-01-2025
5     Rainy  Yes  Vijayawada           30        86  03-02-2025

In [22]:
df.columns

Index(['Condition', 'Play', 'City', 'Temperature', 'Humidity', 'Date'], dtype='object')

In [11]:
df.Date

0     03-01-2025
1     06-01-2025
2     14-01-2025
3     24-01-2025
4     25-01-2025
5     03-02-2025
6     07-02-2025
7     12-02-2025
8     15-02-2025
9     22-02-2025
10    27-02-2025
11    03-03-2025
12    25-03-2025
13    29-03-2025
Name: Date, dtype: object

In [23]:
df['Date']

0     03-01-2025
1     06-01-2025
2     14-01-2025
3     24-01-2025
4     25-01-2025
5     03-02-2025
6     07-02-2025
7     12-02-2025
8     15-02-2025
9     22-02-2025
10    27-02-2025
11    03-03-2025
12    25-03-2025
13    29-03-2025
Name: Date, dtype: object

In [24]:
df[['Date','Condition']]

          Date Condition
0   03-01-2025     Rainy
1   06-01-2025     Sunny
2   14-01-2025  Overcast
3   24-01-2025  Overcast
4   25-01-2025     Sunny
5   03-02-2025     Rainy
6   07-02-2025     Sunny
7   12-02-2025  Overcast
8   15-02-2025     Rainy
9   22-02-2025     Sunny
10  27-02-2025     Sunny
11  03-03-2025     Rainy
12  25-03-2025  Overcast
13  29-03-2025  Overcast

In [37]:
df['Date'][df['Condition']=='Rainy']

0     03-01-2025
5     03-02-2025
8     15-02-2025
11    03-03-2025
Name: Date, dtype: object

# Reading Data (csv)

In [42]:
data=pd.DataFrame({
    "name":["sai","ajay","sai","tarun","jaggu","karthik"],
    "age":[18,19,18,37,26,32]
})
data

      name  age
0      sai   18
1     ajay   19
2      sai   18
3    tarun   37
4    jaggu   26
5  karthik   32

In [43]:
data.head()

    name  age
0    sai   18
1   ajay   19
2    sai   18
3  tarun   37
4  jaggu   26

In [44]:
data.tail()

      name  age
1     ajay   19
2      sai   18
3    tarun   37
4    jaggu   26
5  karthik   32

In [45]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     6 non-null      int64
dtypes: int64(1), object(1)
memory usage: 228.0+ bytes

In [46]:
data.shape

(6, 2)

In [48]:
data.columns

Index(['name', 'age'], dtype='object')

In [49]:
data.age

0    18
1    19
2    18
3    37
4    26
5    32
Name: age, dtype: int64

In [52]:
data['age']

0    18
1    19
2    18
3    37
4    26
5    32
Name: age, dtype: int64

In [50]:
data.index

RangeIndex(start=0, stop=6, step=1)

In [53]:
data.dtypes

name    object
age      int64
dtype: object